[tasks]
bmc
prove
cover

[options]
bmc: mode bmc
bmc: depth 20
prove: mode prove
cover: mode cover
cover: append 10

[engines]
bmc: smtbmc
prove: smtbmc
cover: smtbmc z3

[script]
read -formal jtag.v
prep -top jtag
memory_map -rom-only
# use this to help track down PREUNSAT, only works on a single module at a time.
# hierarchy -check; proc; opt
# sat -prove-asserts -set-assumes

[files]
jtag.v
byte_transmitter.v
mux_2_1.v